tiborsimon/embedded-tdd-headers/pic/pic16/pic16lf1709_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC16LF1709_H_
#define _PIC16LF1709_H_

#define INDF0                         0
#define INDF1                         1
#define PCL                           2
#define STATUS                        3
#define C                             4
#define CARRY                         5
#define DC                            6
#define ZERO                          7
#define Z                             8
#define nPD                           9
#define nTO                           10
#define FSR0L                         11
#define FSR0H                         12
#define FSR1L                         13
#define FSR1H                         14
#define BSR                           15
#define BSR0                          16
#define BSR1                          17
#define BSR2                          18
#define BSR3                          19
#define BSR4                          20
#define WREG                          21
#define WREG0                         22
#define PCLATH                        23
#define INTCON                        24
#define IOCIF                         25
#define INTF                          26
#define T0IF                          27
#define TMR0IF                        28
#define IOCIE                         29
#define INTE                          30
#define T0IE                          31
#define TMR0IE                        32
#define PEIE                          33
#define GIE                           34
#define PORTA                         35
#define RA0                           36
#define RA1                           37
#define RA2                           38
#define RA3                           39
#define RA4                           40
#define RA5                           41
#define PORTB                         42
#define RB4                           43
#define RB5                           44
#define RB6                           45
#define RB7                           46
#define PORTC                         47
#define RC0                           48
#define RC1                           49
#define RC2                           50
#define RC3                           51
#define RC4                           52
#define RC5                           53
#define RC6                           54
#define RC7                           55
#define PIR1                          56
#define TMR1IF                        57
#define TMR2IF                        58
#define CCP1IF                        59
#define CCPIF                         60
#define SSP1IF                        61
#define TXIF                          62
#define RCIF                          63
#define ADIF                          64
#define TMR1GIF                       65
#define PIR2                          66
#define CCP2IF                        67
#define TMR4IF                        68
#define TMR6IF                        69
#define BCL1IF                        70
#define C1IF                          71
#define C2IF                          72
#define OSFIF                         73
#define PIR3                          74
#define CLC1IF                        75
#define CLC2IF                        76
#define CLC3IF                        77
#define ZCDIF                         78
#define COGIF                         79
#define TMR0                          80
#define TMR1L                         81
#define TMR1H                         82
#define T1CON                         83
#define TMR1ON                        84
#define nT1SYNC                       85
#define T1OSCEN                       86
#define T1CKPS0                       87
#define T1CKPS                        88
#define T1CKPS1                       89
#define TMR1CS0                       90
#define TMR1CS                        91
#define TMR1CS1                       92
#define T1GCON                        93
#define T1GSS0                        94
#define T1GSS                         95
#define T1GSS1                        96
#define T1GVAL                        97
#define T1GGO_nDONE                   98
#define T1GSPM                        99
#define T1GTM                         100
#define T1GPOL                        101
#define TMR1GE                        102
#define TMR2                          103
#define PR2                           104
#define T2CON                         105
#define T2CKPS0                       106
#define T2CKPS                        107
#define T2CKPS1                       108
#define TMR2ON                        109
#define T2OUTPS0                      110
#define T2OUTPS                       111
#define T2OUTPS1                      112
#define T2OUTPS2                      113
#define T2OUTPS3                      114
#define TRISA                         115
#define TRISA0                        116
#define TRISA1                        117
#define TRISA2                        118
#define TRISA4                        119
#define TRISA5                        120
#define TRISB                         121
#define TRISB4                        122
#define TRISB5                        123
#define TRISB6                        124
#define TRISB7                        125
#define TRISC                         126
#define TRISC0                        127
#define TRISC1                        128
#define TRISC2                        129
#define TRISC3                        130
#define TRISC4                        131
#define TRISC5                        132
#define TRISC6                        133
#define TRISC7                        134
#define PIE1                          135
#define TMR1IE                        136
#define TMR2IE                        137
#define PIE1_CCP1IE                   138
#define CCPIE                         139
#define SSP1IE                        140
#define TXIE                          141
#define RCIE                          142
#define ADIE                          143
#define TMR1GIE                       144
#define PIE2                          145
#define CCP2IE                        146
#define TMR4IE                        147
#define TMR6IE                        148
#define BCL1IE                        149
#define C1IE                          150
#define C2IE                          151
#define OSFIE                         152
#define PIE3                          153
#define CLC1IE                        154
#define CLC2IE                        155
#define CLC3IE                        156
#define PIE3_CCP1IE                   157
#define ZCDIE                         158
#define COGIE                         159
#define OPTION_REG                    160
#define PS                            161
#define PS0                           162
#define PS1                           163
#define PS2                           164
#define PSA                           165
#define T0SE                          166
#define TMR0SE                        167
#define T0CS                          168
#define TMR0CS                        169
#define INTEDG                        170
#define nWPUEN                        171
#define PCON                          172
#define nBOR                          173
#define nPOR                          174
#define nRI                           175
#define nRMCLR                        176
#define nRWDT                         177
#define STKUNF                        178
#define STKOVF                        179
#define WDTCON                        180
#define SWDTEN                        181
#define WDTPS                         182
#define WDTPS0                        183
#define WDTPS1                        184
#define WDTPS2                        185
#define WDTPS3                        186
#define WDTPS4                        187
#define OSCTUNE                       188
#define TUN0                          189
#define TUN                           190
#define TUN1                          191
#define TUN2                          192
#define TUN3                          193
#define TUN4                          194
#define TUN5                          195
#define OSCCON                        196
#define SCS0                          197
#define SCS                           198
#define SCS1                          199
#define IRCF                          200
#define IRCF0                         201
#define IRCF1                         202
#define IRCF2                         203
#define IRCF3                         204
#define SPLLEN                        205
#define OSCSTAT                       206
#define HFIOFS                        207
#define LFIOFR                        208
#define MFIOFR                        209
#define HFIOFL                        210
#define HFIOFR                        211
#define OSTS                          212
#define PLLR                          213
#define SOSCR                         214
#define ADRESL                        215
#define ADRESH                        216
#define ADCON0                        217
#define ADON                          218
#define GO_nDONE                      219
#define GO                            220
#define ADGO                          221
#define CHS0                          222
#define CHS                           223
#define CHS1                          224
#define CHS2                          225
#define CHS3                          226
#define CHS4                          227
#define ADCON1                        228
#define ADPREF0                       229
#define ADPREF                        230
#define ADPREF1                       231
#define ADNREF                        232
#define ADCS                          233
#define ADFM                          234
#define ADCON2                        235
#define TRIGSEL                       236
#define TRIGSEL0                      237
#define TRIGSEL1                      238
#define TRIGSEL2                      239
#define TRIGSEL3                      240
#define LATA                          241
#define LATA0                         242
#define LATA1                         243
#define LATA2                         244
#define LATA4                         245
#define LATA5                         246
#define LATB                          247
#define LATB4                         248
#define LATB5                         249
#define LATB6                         250
#define LATB7                         251
#define LATC                          252
#define LATC0                         253
#define LATC1                         254
#define LATC2                         255
#define LATC3                         256
#define LATC4                         257
#define LATC5                         258
#define LATC6                         259
#define LATC7                         260
#define CM1CON0                       261
#define C1SYNC                        262
#define C1HYS                         263
#define C1SP                          264
#define C1ZLF                         265
#define C1POL                         266
#define C1OUT                         267
#define C1ON                          268
#define CM1CON1                       269
#define C1NCH0                        270
#define C1NCH                         271
#define C1NCH1                        272
#define C1NCH2                        273
#define C1PCH                         274
#define C1PCH0                        275
#define C1PCH1                        276
#define C1PCH2                        277
#define C1INTN                        278
#define C1INTP                        279
#define CM2CON0                       280
#define C2SYNC                        281
#define C2HYS                         282
#define C2SP                          283
#define C2ZLF                         284
#define C2POL                         285
#define C2OUT                         286
#define C2ON                          287
#define CM2CON1                       288
#define C2NCH0                        289
#define C2NCH                         290
#define C2NCH1                        291
#define C2NCH2                        292
#define C2PCH                         293
#define C2PCH0                        294
#define C2PCH1                        295
#define C2PCH2                        296
#define C2INTN                        297
#define C2INTP                        298
#define CMOUT                         299
#define MC1OUT                        300
#define MC2OUT                        301
#define BORCON                        302
#define BORRDY                        303
#define BORFS                         304
#define SBOREN                        305
#define FVRCON                        306
#define ADFVR0                        307
#define ADFVR                         308
#define ADFVR1                        309
#define CDAFVR                        310
#define CDAFVR0                       311
#define CDAFVR1                       312
#define TSRNG                         313
#define TSEN                          314
#define FVRRDY                        315
#define FVREN                         316
#define DAC1CON0                      317
#define DACNSS                        318
#define DAC1NSS                       319
#define DACPSS                        320
#define DACPSS0                       321
#define DAC1PSS                       322
#define DAC1PSS0                      323
#define DACPSS1                       324
#define DAC1PSS1                      325
#define DACOE0                        326
#define DAC1OE2                       327
#define DAC1OE1                       328
#define DACOE1                        329
#define DACEN                         330
#define DAC1EN                        331
#define DAC1CON1                      332
#define DAC1R                         333
#define DACR0                         334
#define DAC1R0                        335
#define DACR1                         336
#define DAC1R1                        337
#define DACR2                         338
#define DAC1R2                        339
#define DACR3                         340
#define DAC1R3                        341
#define DACR4                         342
#define DAC1R4                        343
#define DACR5                         344
#define DAC1R5                        345
#define DACR6                         346
#define DAC1R6                        347
#define DACR7                         348
#define DAC1R7                        349
#define ZCD1CON                       350
#define ZCD1INTN                      351
#define ZCD1INTP                      352
#define ZCD1POL                       353
#define ZCD1OUT                       354
#define ZCD1EN                        355
#define ANSELA                        356
#define ANSA0                         357
#define ANSA1                         358
#define ANSA2                         359
#define ANSA4                         360
#define ANS5                          361
#define ANSELB                        362
#define ANSB4                         363
#define ANSB5                         364
#define ANSELC                        365
#define ANSC0                         366
#define ANSC1                         367
#define ANSC2                         368
#define ANSC3                         369
#define ANSC6                         370
#define ANSC7                         371
#define PMADRL                        372
#define PMADRH                        373
#define PMDATL                        374
#define PMDATH                        375
#define PMCON1                        376
#define RD                            377
#define WR                            378
#define WREN                          379
#define WRERR                         380
#define FREE                          381
#define LWLO                          382
#define CFGS                          383
#define PMCON2                        384
#define RC1REG                        385
#define TX1REG                        386
#define SP1BRGL                       387
#define SP1BRGH                       388
#define RC1STA                        389
#define RX9D                          390
#define OERR                          391
#define FERR                          392
#define ADDEN                         393
#define CREN                          394
#define SREN                          395
#define RX9                           396
#define SPEN                          397
#define TX1STA                        398
#define TX9D                          399
#define TRMT                          400
#define BRGH                          401
#define SENDB                         402
#define SYNC                          403
#define TXEN                          404
#define TX9                           405
#define CSRC                          406
#define BAUD1CON                      407
#define ABDEN                         408
#define WUE                           409
#define BRG16                         410
#define SCKP                          411
#define RCIDL                         412
#define ABDOVF                        413
#define WPUA                          414
#define WPUA0                         415
#define WPUA1                         416
#define WPUA2                         417
#define WPUA3                         418
#define WPUA4                         419
#define WPUA5                         420
#define WPUB                          421
#define WPUB4                         422
#define WPUB5                         423
#define WPUB6                         424
#define WPUB7                         425
#define WPUC                          426
#define WPUC0                         427
#define WPUC1                         428
#define WPUC2                         429
#define WPUC3                         430
#define WPUC4                         431
#define WPUC5                         432
#define WPUC6                         433
#define WPUC7                         434
#define SSP1BUF                       435
#define BUF                           436
#define BUF0                          437
#define SSP1BUF0                      438
#define BUF1                          439
#define SSP1BUF1                      440
#define BUF2                          441
#define SSP1BUF2                      442
#define BUF3                          443
#define SSP1BUF3                      444
#define BUF4                          445
#define SSP1BUF4                      446
#define BUF5                          447
#define SSP1BUF5                      448
#define BUF6                          449
#define SSP1BUF6                      450
#define BUF7                          451
#define SSP1BUF7                      452
#define ADD0                          453
#define ADD                           454
#define SSP1ADD0                      455
#define SSP1ADD                       456
#define ADD1                          457
#define SSP1ADD1                      458
#define ADD2                          459
#define SSP1ADD2                      460
#define ADD3                          461
#define SSP1ADD3                      462
#define ADD4                          463
#define SSP1ADD4                      464
#define ADD5                          465
#define SSP1ADD5                      466
#define ADD6                          467
#define SSP1ADD6                      468
#define ADD7                          469
#define SSP1ADD7                      470
#define SSP1MSK0                      471
#define SSP1MSK                       472
#define MSK0                          473
#define MSK                           474
#define SSP1MSK1                      475
#define MSK1                          476
#define SSP1MSK2                      477
#define MSK2                          478
#define SSP1MSK3                      479
#define MSK3                          480
#define SSP1MSK4                      481
#define MSK4                          482
#define SSP1MSK5                      483
#define MSK5                          484
#define SSP1MSK6                      485
#define MSK6                          486
#define SSP1MSK7                      487
#define MSK7                          488
#define SSP1STAT                      489
#define BF                            490
#define UA                            491
#define R_nW                          492
#define S                             493
#define P                             494
#define D_nA                          495
#define CKE                           496
#define SMP                           497
#define SSP1CON1                      498
#define SSPM0                         499
#define SSPM                          500
#define SSPM1                         501
#define SSPM2                         502
#define SSPM3                         503
#define CKP                           504
#define SSPEN                         505
#define SSPOV                         506
#define WCOL                          507
#define SSP1CON2                      508
#define SEN                           509
#define RSEN                          510
#define PEN                           511
#define RCEN                          512
#define ACKEN                         513
#define ACKDT                         514
#define ACKSTAT                       515
#define GCEN                          516
#define SSP1CON3                      517
#define DHEN                          518
#define AHEN                          519
#define SBCDE                         520
#define SDAHT                         521
