tiborsimon/embedded-tdd-headers/pic/pic16/pic16lf1709_tdd.h
#define BOEN                          522
#define SCIE                          523
#define PCIE                          524
#define ACKTIM                        525
#define ODCONA                        526
#define ODA0                          527
#define ODA1                          528
#define ODA2                          529
#define ODA4                          530
#define ODA5                          531
#define ODCONB                        532
#define ODB4                          533
#define ODB5                          534
#define ODB6                          535
#define ODB7                          536
#define ODCONC                        537
#define ODC0                          538
#define ODC1                          539
#define ODC2                          540
#define ODC3                          541
#define ODC4                          542
#define ODC5                          543
#define ODC6                          544
#define ODC7                          545
#define CCPR1L                        546
#define CCPR1H                        547
#define CCP1CON                       548
#define CCP1M0                        549
#define CCP1M                         550
#define CCP1M1                        551
#define CCP1M2                        552
#define CCP1M3                        553
#define CCP1Y                         554
#define DC1B                          555
#define DC1B0                         556
#define CCP1X                         557
#define DC1B1                         558
#define CCPR2L                        559
#define CCPR2H                        560
#define CCP2CON                       561
#define CCP2M                         562
#define CCP2M0                        563
#define CCP2M1                        564
#define CCP2M2                        565
#define CCP2M3                        566
#define DC2B0                         567
#define CCP2Y                         568
#define DC2B                          569
#define DC2B1                         570
#define CCP2X                         571
#define CCPTMRS                       572
#define C1TSEL0                       573
#define C1TSEL                        574
#define C1TSEL1                       575
#define C2TSEL0                       576
#define C2TSEL                        577
#define C2TSEL1                       578
#define P3TSEL                        579
#define P3TSEL0                       580
#define P3TSEL1                       581
#define P4TSEL0                       582
#define P4TSEL                        583
#define P4TSEL1                       584
#define SLRCONA                       585
#define SLRA0                         586
#define SLRA1                         587
#define SLRA2                         588
#define SLRA4                         589
#define SLRA5                         590
#define SLRCONB                       591
#define SLRB4                         592
#define SLRB5                         593
#define SLRB6                         594
#define SLRB7                         595
#define SLRCONC                       596
#define SLRC0                         597
#define SLRC1                         598
#define SLRC2                         599
#define SLRC3                         600
#define SLRC4                         601
#define SLRC5                         602
#define SLRC6                         603
#define SLRC7                         604
#define INLVLA                        605
#define INLVLA0                       606
#define INLVLA1                       607
#define INLVLA2                       608
#define INLVLA3                       609
#define INLVLA4                       610
#define INLVLA5                       611
#define INLVLB                        612
#define INLVLB4                       613
#define INLVLB5                       614
#define INLVLB6                       615
#define INLVLB7                       616
#define INLVLC                        617
#define INLVLC0                       618
#define INLVLC1                       619
#define INLVLC2                       620
#define INLVLC3                       621
#define INLVLC4                       622
#define INLVLC5                       623
#define INLVLC6                       624
#define INLVLC7                       625
#define IOCAP                         626
#define IOCAP0                        627
#define IOCAP1                        628
#define IOCAP2                        629
#define IOCAP3                        630
#define IOCAP4                        631
#define IOCAP5                        632
#define IOCAN                         633
#define IOCAN0                        634
#define IOCAN1                        635
#define IOCAN2                        636
#define IOCAN3                        637
#define IOCAN4                        638
#define IOCAN5                        639
#define IOCAF                         640
#define IOCAF0                        641
#define IOCAF1                        642
#define IOCAF2                        643
#define IOCAF3                        644
#define IOCAF4                        645
#define IOCAF5                        646
#define IOCBP                         647
#define IOCBP4                        648
#define IOCBP5                        649
#define IOCBP6                        650
#define IOCBP7                        651
#define IOCBN                         652
#define IOCBN4                        653
#define IOCBN5                        654
#define IOCBN6                        655
#define IOCBN7                        656
#define IOCBF                         657
#define IOCBF4                        658
#define IOCBF5                        659
#define IOCBF6                        660
#define IOCBF7                        661
#define IOCCP                         662
#define IOCCP0                        663
#define IOCCP1                        664
#define IOCCP2                        665
#define IOCCP3                        666
#define IOCCP4                        667
#define IOCCP5                        668
#define IOCCP6                        669
#define IOCCP7                        670
#define IOCCN                         671
#define IOCCN0                        672
#define IOCCN1                        673
#define IOCCN2                        674
#define IOCCN3                        675
#define IOCCN4                        676
#define IOCCN5                        677
#define IOCCN6                        678
#define IOCCN7                        679
#define IOCCF                         680
#define IOCCF0                        681
#define IOCCF1                        682
#define IOCCF2                        683
#define IOCCF3                        684
#define IOCCF4                        685
#define IOCCF5                        686
#define IOCCF6                        687
#define IOCCF7                        688
#define TMR4                          689
#define PR4                           690
#define T4CON                         691
#define T4CKPS0                       692
#define T4CKPS                        693
#define T4CKPS1                       694
#define TMR4ON                        695
#define T4OUTPS                       696
#define T4OUTPS0                      697
#define T4OUTPS1                      698
#define T4OUTPS2                      699
#define T4OUTPS3                      700
#define TMR6                          701
#define PR6                           702
#define T6CON                         703
#define T6CKPS0                       704
#define T6CKPS                        705
#define T6CKPS1                       706
#define TMR6ON                        707
#define T6OUTPS0                      708
#define T6OUTPS                       709
#define T6OUTPS1                      710
#define T6OUTPS2                      711
#define T6OUTPS3                      712
#define OPA1CON                       713
#define OPA1PCH                       714
#define OPA1PCH0                      715
#define OPA1PCH1                      716
#define OPA1UG                        717
#define OPA1SP                        718
#define OPA1EN                        719
#define OPA2CON                       720
#define OPA2PCH                       721
#define OPA2PCH0                      722
#define OPA2PCH1                      723
#define OPA2UG                        724
#define OPA2SP                        725
#define OPA2EN                        726
#define PWM3DCL0                      727
#define PWM3DCL                       728
#define PWM3DCL1                      729
#define PWM3DCH0                      730
#define PWM3DCH                       731
#define PWM3DCH1                      732
#define PWM3DCH2                      733
#define PWM3DCH3                      734
#define PWM3DCH4                      735
#define PWM3DCH5                      736
#define PWM3DCH6                      737
#define PWM3DCH7                      738
#define PWM3CON                       739
#define PWM3POL                       740
#define PWM3OUT                       741
#define PWM3EN                        742
#define PWM4DCL                       743
#define PWM4DCL0                      744
#define PWM4DCL1                      745
#define PWM4DCH0                      746
#define PWM4DCH                       747
#define PWM4DCH1                      748
#define PWM4DCH2                      749
#define PWM4DCH3                      750
#define PWM4DCH4                      751
#define PWM4DCH5                      752
#define PWM4DCH6                      753
#define PWM4DCH7                      754
#define PWM4CON                       755
#define PWM4POL                       756
#define PWM4OUT                       757
#define PWM4EN                        758
#define COG1PHR                       759
#define G1PHR                         760
#define G1PHR0                        761
#define G1PHR1                        762
#define G1PHR2                        763
#define G1PHR3                        764
#define G1PHR4                        765
#define G1PHR5                        766
#define COG1PHF                       767
#define G1PHF0                        768
#define G1PHF                         769
#define G1PHF1                        770
#define G1PHF2                        771
#define G1PHF3                        772
#define G1PHF4                        773
#define G1PHF5                        774
#define COG1BLKR                      775
#define G1BLKR                        776
#define G1BLKR0                       777
#define G1BLKR1                       778
#define G1BLKR2                       779
#define G1BLKR3                       780
#define G1BLKR4                       781
#define G1BLKR5                       782
#define COG1BLKF                      783
#define G1BLKF                        784
#define G1BLKF0                       785
#define G1BLKF1                       786
#define G1BLKF2                       787
#define G1BLKF3                       788
#define G1BLKF4                       789
#define G1BLKF5                       790
#define COG1DBR                       791
#define G1DBR0                        792
#define G1DBR                         793
#define G1DBR1                        794
#define G1DBR2                        795
#define G1DBR3                        796
#define G1DBR4                        797
#define G1DBR5                        798
#define COG1DBF                       799
#define G1DBF0                        800
#define G1DBF                         801
#define G1DBF1                        802
#define G1DBF2                        803
#define G1DBF3                        804
#define G1DBF4                        805
#define G1DBF5                        806
#define COG1CON0                      807
#define G1MD0                         808
#define G1MD                          809
#define G1MD1                         810
#define G1MD2                         811
#define G1CS0                         812
#define G1CS                          813
#define G1CS1                         814
#define G1LD                          815
#define G1EN                          816
#define COG1CON1                      817
#define G1POLA                        818
#define G1POLB                        819
#define G1POLC                        820
#define G1POLD                        821
#define G1FDBS                        822
#define G1RDBS                        823
#define COG1RIS                       824
#define G1RIS0                        825
#define G1RIS1                        826
#define G1RIS2                        827
#define G1RIS3                        828
#define G1RIS4                        829
#define G1RIS5                        830
#define G1RIS6                        831
#define COG1RSIM                      832
#define G1RSIM0                       833
#define G1RSIM1                       834
#define G1RSIM2                       835
#define G1RSIM3                       836
#define G1RSIM4                       837
#define G1RSIM5                       838
#define G1RSIM6                       839
#define COG1FIS                       840
#define G1FIS0                        841
#define G1FIS1                        842
#define G1FIS2                        843
#define G1FIS3                        844
#define G1FIS4                        845
#define G1FIS5                        846
#define G1FIS6                        847
#define COG1FSIM                      848
#define G1FSIM0                       849
#define G1FSIM1                       850
#define G1FSIM2                       851
#define G1FSIM3                       852
#define G1FSIM4                       853
#define G1FSIM5                       854
#define G1FSIM6                       855
#define COG1ASD0                      856
#define G1ASDAC0                      857
#define G1ASDAC                       858
#define G1ASDAC1                      859
#define G1ASDBD0                      860
#define G1ASDBD                       861
#define G1ASDBD1                      862
#define G1ARSEN                       863
#define G1ASE                         864
#define COG1ASD1                      865
#define G1AS0E                        866
#define G1AS1E                        867
#define G1AS2E                        868
#define G1AS3E                        869
#define COG1STR                       870
#define G1STRA                        871
#define G1STRB                        872
#define G1STRC                        873
#define G1STRD                        874
#define G1SDATA                       875
#define G1SDATB                       876
#define G1SDATC                       877
#define G1SDATD                       878
#define PPSLOCK                       879
#define PPSLOCKED                     880
#define INTPPS                        881
#define T0CKIPPS                      882
#define T1CKIPPS                      883
#define T1GPPS                        884
#define CCP1PPS                       885
#define CCP2PPS                       886
#define COGINPPS                      887
#define SSPCLKPPS                     888
#define SSPDATPPS                     889
#define SSPSSPPS                      890
#define RXPPS                         891
#define CKPPS                         892
#define CLCIN0PPS                     893
#define CLCIN1PPS                     894
#define CLCIN2PPS                     895
#define CLCIN3PPS                     896
#define RA0PPS                        897
#define RA1PPS                        898
#define RA2PPS                        899
#define RA4PPS                        900
#define RA5PPS                        901
#define RB4PPS                        902
#define RB5PPS                        903
#define RB6PPS                        904
#define RB7PPS                        905
#define RC0PPS                        906
#define RC1PPS                        907
#define RC2PPS                        908
#define RC3PPS                        909
#define RC4PPS                        910
#define RC5PPS                        911
#define RC6PPS                        912
#define RC7PPS                        913
#define CLCDATA                       914
#define MCLC1OUT                      915
#define MCLC2OUT                      916
#define MCLC3OUT                      917
#define CLC1CON                       918
#define CLC1CON_MODE                  919
#define LC1MODE0                      920
#define LC1MODE                       921
#define CLC1CON_MODE0                 922
#define LC1MODE1                      923
#define CLC1CON_MODE1                 924
#define CLC1CON_MODE2                 925
#define LC1MODE2                      926
#define LC1INTN                       927
#define CLC1CON_INTN                  928
#define LC1INTP                       929
#define CLC1CON_INTP                  930
#define CLC1CON_OUT                   931
#define LC1OUT                        932
#define LC1EN                         933
#define CLC1CON_EN                    934
#define CLC1POL                       935
#define LC1G1POL                      936
#define CLC1POL_G1POL                 937
#define CLC1POL_G2POL                 938
#define LC1G2POL                      939
#define LC1G3POL                      940
#define CLC1POL_G3POL                 941
#define LC1G4POL                      942
#define CLC1POL_G4POL                 943
#define CLC1POL_POL                   944
#define LC1POL                        945
#define CLC1SEL0                      946
#define CLC1SEL0_D1S0                 947
#define LC1D1S                        948
#define LC1D1S0                       949
#define CLC1SEL0_D1S                  950
#define CLC1SEL0_D1S1                 951
#define LC1D1S1                       952
#define CLC1SEL0_D1S2                 953
#define LC1D1S2                       954
#define CLC1SEL0_D1S3                 955
#define LC1D1S3                       956
#define CLC1SEL0_D1S4                 957
#define LC1D1S4                       958
#define CLC1SEL1                      959
#define CLC1SEL1_D2S0                 960
#define CLC1SEL1_D2S                  961
#define LC1D2S                        962
#define LC1D2S0                       963
#define CLC1SEL1_D2S1                 964
#define LC1D2S1                       965
#define LC1D2S2                       966
#define CLC1SEL1_D2S2                 967
#define LC1D2S3                       968
#define CLC1SEL1_D2S3                 969
#define LC1D2S4                       970
#define CLC1SEL1_D2S4                 971
#define CLC1SEL2                      972
#define LC1D3S0                       973
#define CLC1SEL2_D3S                  974
#define LC1D3S                        975
#define CLC1SEL2_D3S0                 976
#define LC1D3S1                       977
#define CLC1SEL2_D3S1                 978
#define LC1D3S2                       979
#define CLC1SEL2_D3S2                 980
#define LC1D3S3                       981
#define CLC1SEL2_D3S3                 982
#define LC1D3S4                       983
#define CLC1SEL2_D3S4                 984
#define CLC1SEL3                      985
#define CLC1SEL3_D4S                  986
#define LC1D4S                        987
#define LC1D4S0                       988
#define CLC1SEL3_D4S0                 989
#define CLC1SEL3_D4S1                 990
#define LC1D4S1                       991
#define LC1D4S2                       992
#define CLC1SEL3_D4S2                 993
#define LC1D4S3                       994
#define CLC1SEL3_D4S3                 995
#define LC1D4S4                       996
#define CLC1SEL3_D4S4                 997
#define CLC1GLS0                      998
#define CLC1GLS0_D1N                  999
#define LC1G1D1N                      1000
#define CLC1GLS0_D1T                  1001
#define LC1G1D1T                      1002
#define LC1G1D2N                      1003
#define CLC1GLS0_D2N                  1004
#define LC1G1D2T                      1005
#define CLC1GLS0_D2T                  1006
#define CLC1GLS0_D3N                  1007
#define LC1G1D3N                      1008
#define CLC1GLS0_D3T                  1009
#define LC1G1D3T                      1010
#define CLC1GLS0_D4N                  1011
#define LC1G1D4N                      1012
#define CLC1GLS0_D4T                  1013
#define LC1G1D4T                      1014
#define CLC1GLS1                      1015
#define CLC1GLS1_D1N                  1016
#define LC1G2D1N                      1017
#define LC1G2D1T                      1018
#define CLC1GLS1_D1T                  1019
#define CLC1GLS1_D2N                  1020
#define LC1G2D2N                      1021
#define LC1G2D2T                      1022
#define CLC1GLS1_D2T                  1023
#define CLC1GLS1_D3N                  1024
#define LC1G2D3N                      1025
#define LC1G2D3T                      1026
#define CLC1GLS1_D3T                  1027
#define CLC1GLS1_D4N                  1028
#define LC1G2D4N                      1029
#define LC1G2D4T                      1030
#define CLC1GLS1_D4T                  1031
#define CLC1GLS2                      1032
#define CLC1GLS2_D1N                  1033
#define LC1G3D1N                      1034
#define LC1G3D1T                      1035
#define CLC1GLS2_D1T                  1036
#define LC1G3D2N                      1037
#define CLC1GLS2_D2N                  1038
#define LC1G3D2T                      1039
#define CLC1GLS2_D2T                  1040
#define CLC1GLS2_D3N                  1041
#define LC1G3D3N                      1042
#define LC1G3D3T                      1043
#define CLC1GLS2_D3T                  1044
#define LC1G3D4N                      1045
#define CLC1GLS2_D4N                  1046
#define LC1G3D4T                      1047
#define CLC1GLS2_D4T                  1048
#define CLC1GLS3                      1049
#define LC1G4D1N                      1050
#define CLC1GLS3_G4D1N                1051
#define LC1G4D1T                      1052
#define CLC1GLS3_G4D1T                1053
#define CLC1GLS3_G4D2N                1054
#define LC1G4D2N                      1055
#define CLC1GLS3_G4D2T                1056
#define LC1G4D2T                      1057
#define LC1G4D3N                      1058
#define CLC1GLS3_G4D3N                1059
#define LC1G4D3T                      1060
#define CLC1GLS3_G4D3T                1061
#define CLC1GLS3_G4D4N                1062
#define LC1G4D4N                      1063
#define CLC1GLS3_G4D4T                1064
#define LC1G4D4T                      1065
#define CLC2CON                       1066
#define LC2MODE0                      1067
#define CLC2CON_MODE                  1068
#define LC2MODE                       1069
#define CLC2CON_MODE0                 1070
#define LC2MODE1                      1071
#define CLC2CON_MODE1                 1072
#define LC2MODE2                      1073
#define CLC2CON_MODE2                 1074
#define LC2INTN                       1075
#define CLC2CON_INTN                  1076
#define LC2INTP                       1077
#define CLC2CON_INTP                  1078
#define CLC2CON_OUT                   1079
#define LC2OUT                        1080
#define CLC2CON_EN                    1081
#define LC2EN                         1082
#define CLC2POL                       1083
#define LC2G1POL                      1084
#define CLC2POL_G1POL                 1085
#define LC2G2POL                      1086
#define CLC2POL_G2POL                 1087
#define LC2G3POL                      1088
#define CLC2POL_G3POL                 1089
#define LC2G4POL                      1090
