tiborsimon/embedded-tdd-headers/pic/pic16/pic16lf1709_tdd.h
#define CLC2POL_G4POL                 1091
#define CLC2POL_POL                   1092
#define LC2POL                        1093
#define CLC2SEL0                      1094
#define CLC2SEL0_D1S                  1095
#define LC2D1S0                       1096
#define CLC2SEL0_D1S0                 1097
#define LC2D1S                        1098
#define LC2D1S1                       1099
#define CLC2SEL0_D1S1                 1100
#define LC2D1S2                       1101
#define CLC2SEL0_D1S2                 1102
#define CLC2SEL0_D1S3                 1103
#define LC2D1S3                       1104
#define LC2D1S4                       1105
#define CLC2SEL0_D1S4                 1106
#define CLC2SEL1                      1107
#define LC2D2S0                       1108
#define CLC2SEL1_D2S0                 1109
#define LC2D2S                        1110
#define CLC2SEL1_D2S                  1111
#define LC2D2S1                       1112
#define CLC2SEL1_D2S1                 1113
#define LC2D2S2                       1114
#define CLC2SEL1_D2S2                 1115
#define LC2D2S3                       1116
#define CLC2SEL1_D2S3                 1117
#define LC2D2S4                       1118
#define CLC2SEL1_D2S4                 1119
#define CLC2SEL2                      1120
#define CLC2SEL2_D3S                  1121
#define LC2D3S0                       1122
#define CLC2SEL2_D3S0                 1123
#define LC2D3S                        1124
#define CLC2SEL2_D3S1                 1125
#define LC2D3S1                       1126
#define LC2D3S2                       1127
#define CLC2SEL2_D3S2                 1128
#define LC2D3S3                       1129
#define CLC2SEL2_D3S3                 1130
#define LC2D3S4                       1131
#define CLC2SEL2_D3S4                 1132
#define CLC2SEL3                      1133
#define LC2D4S                        1134
#define LC2D4S0                       1135
#define CLC2SEL3_D4S                  1136
#define CLC2SEL3_D4S0                 1137
#define LC2D4S1                       1138
#define CLC2SEL3_D4S1                 1139
#define LC2D4S2                       1140
#define CLC2SEL3_D4S2                 1141
#define CLC2SEL3_D4S3                 1142
#define LC2D4S3                       1143
#define LC2D4S4                       1144
#define CLC2SEL3_D4S4                 1145
#define CLC2GLS0                      1146
#define LC2G1D1N                      1147
#define CLC2GLS0_D1N                  1148
#define CLC2GLS0_D1T                  1149
#define LC2G1D1T                      1150
#define LC2G1D2N                      1151
#define CLC2GLS0_D2N                  1152
#define CLC2GLS0_D2T                  1153
#define LC2G1D2T                      1154
#define LC2G1D3N                      1155
#define CLC2GLS0_D3N                  1156
#define CLC2GLS0_D3T                  1157
#define LC2G1D3T                      1158
#define LC2G1D4N                      1159
#define CLC2GLS0_D4N                  1160
#define CLC2GLS0_D4T                  1161
#define LC2G1D4T                      1162
#define CLC2GLS1                      1163
#define CLC2GLS1_D1N                  1164
#define LC2G2D1N                      1165
#define CLC2GLS1_D1T                  1166
#define LC2G2D1T                      1167
#define CLC2GLS1_D2N                  1168
#define LC2G2D2N                      1169
#define CLC2GLS1_D2T                  1170
#define LC2G2D2T                      1171
#define LC2G2D3N                      1172
#define CLC2GLS1_D3N                  1173
#define LC2G2D3T                      1174
#define CLC2GLS1_D3T                  1175
#define LC2G2D4N                      1176
#define CLC2GLS1_D4N                  1177
#define LC2G2D4T                      1178
#define CLC2GLS1_D4T                  1179
#define CLC2GLS2                      1180
#define LC2G3D1N                      1181
#define CLC2GLS2_D1N                  1182
#define CLC2GLS2_D1T                  1183
#define LC2G3D1T                      1184
#define CLC2GLS2_D2N                  1185
#define LC2G3D2N                      1186
#define LC2G3D2T                      1187
#define CLC2GLS2_D2T                  1188
#define CLC2GLS2_D3N                  1189
#define LC2G3D3N                      1190
#define CLC2GLS2_D3T                  1191
#define LC2G3D3T                      1192
#define CLC2GLS2_D4N                  1193
#define LC2G3D4N                      1194
#define LC2G3D4T                      1195
#define CLC2GLS2_D4T                  1196
#define CLC2GLS3                      1197
#define LC2G4D1N                      1198
#define CLC2GLS3_G4D1N                1199
#define CLC2GLS3_G4D1T                1200
#define LC2G4D1T                      1201
#define CLC2GLS3_G4D2N                1202
#define LC2G4D2N                      1203
#define LC2G4D2T                      1204
#define CLC2GLS3_G4D2T                1205
#define CLC2GLS3_G4D3N                1206
#define LC2G4D3N                      1207
#define CLC2GLS3_G4D3T                1208
#define LC2G4D3T                      1209
#define LC2G4D4N                      1210
#define CLC2GLS3_G4D4N                1211
#define CLC2GLS3_G4D4T                1212
#define LC2G4D4T                      1213
#define CLC3CON                       1214
#define LC3MODE0                      1215
#define CLC3CON_MODE0                 1216
#define CLC3CON_MODE                  1217
#define LC3MODE                       1218
#define LC3MODE1                      1219
#define CLC3CON_MODE1                 1220
#define LC3MODE2                      1221
#define CLC3CON_MODE2                 1222
#define LC3INTN                       1223
#define CLC3CON_INTN                  1224
#define CLC3CON_INTP                  1225
#define LC3INTP                       1226
#define CLC3CON_OUT                   1227
#define LC3OUT                        1228
#define LC3EN                         1229
#define CLC3CON_EN                    1230
#define CLC3POL                       1231
#define LC3G1POL                      1232
#define CLC3POL_G1POL                 1233
#define LC3G2POL                      1234
#define CLC3POL_G2POL                 1235
#define CLC3POL_G3POL                 1236
#define LC3G3POL                      1237
#define LC3G4POL                      1238
#define CLC3POL_G4POL                 1239
#define LC3POL                        1240
#define CLC3POL_POL                   1241
#define CLC3SEL0                      1242
#define CLC3SEL0_D1S0                 1243
#define LC3D1S0                       1244
#define LC3D1S                        1245
#define CLC3SEL0_D1S                  1246
#define LC3D1S1                       1247
#define CLC3SEL0_D1S1                 1248
#define LC3D1S2                       1249
#define CLC3SEL0_D1S2                 1250
#define LC3D1S3                       1251
#define CLC3SEL0_D1S3                 1252
#define LC3D1S4                       1253
#define CLC3SEL0_D1S4                 1254
#define CLC3SEL1                      1255
#define CLC3SEL1_D2S                  1256
#define CLC3SEL1_D2S0                 1257
#define LC3D2S                        1258
#define LC3D2S0                       1259
#define CLC3SEL1_D2S1                 1260
#define LC3D2S1                       1261
#define CLC3SEL1_D2S2                 1262
#define LC3D2S2                       1263
#define CLC3SEL1_D2S3                 1264
#define LC3D2S3                       1265
#define LC3D2S4                       1266
#define CLC3SEL1_D2S4                 1267
#define CLC3SEL2                      1268
#define CLC3SEL2_D3S0                 1269
#define LC3D3S                        1270
#define CLC3SEL2_D3S                  1271
#define LC3D3S0                       1272
#define LC3D3S1                       1273
#define CLC3SEL2_D3S1                 1274
#define LC3D3S2                       1275
#define CLC3SEL2_D3S2                 1276
#define LC3D3S3                       1277
#define CLC3SEL2_D3S3                 1278
#define LC3D3S4                       1279
#define CLC3SEL2_D3S4                 1280
#define CLC3SEL3                      1281
#define CLC3SEL3_D4S0                 1282
#define LC3D4S0                       1283
#define LC3D4S                        1284
#define CLC3SEL3_D4S                  1285
#define LC3D4S1                       1286
#define CLC3SEL3_D4S1                 1287
#define LC3D4S2                       1288
#define CLC3SEL3_D4S2                 1289
#define LC3D4S3                       1290
#define CLC3SEL3_D4S3                 1291
#define LC3D4S4                       1292
#define CLC3SEL3_D4S4                 1293
#define CLC3GLS0                      1294
#define CLC3GLS0_D1N                  1295
#define LC3G1D1N                      1296
#define LC3G1D1T                      1297
#define CLC3GLS0_D1T                  1298
#define LC3G1D2N                      1299
#define CLC3GLS0_D2N                  1300
#define CLC3GLS0_D2T                  1301
#define LC3G1D2T                      1302
#define CLC3GLS0_D3N                  1303
#define LC3G1D3N                      1304
#define LC3G1D3T                      1305
#define CLC3GLS0_D3T                  1306
#define CLC3GLS0_D4N                  1307
#define LC3G1D4N                      1308
#define CLC3GLS0_D4T                  1309
#define LC3G1D4T                      1310
#define CLC3GLS1                      1311
#define LC3G2D1N                      1312
#define CLC3GLS1_D1N                  1313
#define CLC3GLS1_D1T                  1314
#define LC3G2D1T                      1315
#define LC3G2D2N                      1316
#define CLC3GLS1_D2N                  1317
#define LC3G2D2T                      1318
#define CLC3GLS1_D2T                  1319
#define LC3G2D3N                      1320
#define CLC3GLS1_D3N                  1321
#define CLC3GLS1_D3T                  1322
#define LC3G2D3T                      1323
#define LC3G2D4N                      1324
#define CLC3GLS1_D4N                  1325
#define LC3G2D4T                      1326
#define CLC3GLS1_D4T                  1327
#define CLC3GLS2                      1328
#define LC3G3D1N                      1329
#define CLC3GLS2_D1N                  1330
#define LC3G3D1T                      1331
#define CLC3GLS2_D1T                  1332
#define CLC3GLS2_D2N                  1333
#define LC3G3D2N                      1334
#define CLC3GLS2_D2T                  1335
#define LC3G3D2T                      1336
#define CLC3GLS2_D3N                  1337
#define LC3G3D3N                      1338
#define LC3G3D3T                      1339
#define CLC3GLS2_D3T                  1340
#define CLC3GLS2_D4N                  1341
#define LC3G3D4N                      1342
#define CLC3GLS2_D4T                  1343
#define LC3G3D4T                      1344
#define CLC3GLS3                      1345
#define LC3G4D1N                      1346
#define CLC3GLS3_G4D1N                1347
#define LC3G4D1T                      1348
#define CLC3GLS3_G4D1T                1349
#define LC3G4D2N                      1350
#define CLC3GLS3_G4D2N                1351
#define CLC3GLS3_G4D2T                1352
#define LC3G4D2T                      1353
#define LC3G4D3N                      1354
#define CLC3GLS3_G4D3N                1355
#define CLC3GLS3_G4D3T                1356
#define LC3G4D3T                      1357
#define LC3G4D4N                      1358
#define CLC3GLS3_G4D4N                1359
#define LC3G4D4T                      1360
#define CLC3GLS3_G4D4T                1361
#define ICDBK0H                       1362
#define BKA8                          1363
#define BKA9                          1364
#define BKA10                         1365
#define BKA11                         1366
#define BKA12                         1367
#define BKA13                         1368
#define BKA14                         1369
#define STATUS_SHAD                   1370
#define C_SHAD                        1371
#define DC_SHAD                       1372
#define Z_SHAD                        1373
#define WREG_SHAD                     1374
#define BSR_SHAD                      1375
#define PCLATH_SHAD                   1376
#define FSR0L_SHAD                    1377
#define FSR0H_SHAD                    1378
#define FSR1L_SHAD                    1379
#define FSR1H_SHAD                    1380
#define STKPTR                        1381
#define TOSL                          1382
#define TOSH                          1383

#endif // _PIC16LF1709_H_
